a = input()
b = input()

if (a == 'камень' and b == 'ножницы') or (a == 'камень' and b == 'ром') or \
   (a == 'ножницы' and b == 'бумага') or (a == 'ножницы' and b == 'ром') or \
   (a == 'бумага' and b == 'камень') or (a == 'бумага' and b == 'пират') or \
   (a == 'пират' and b == 'ножницы') or (a == 'пират' and b == 'камень') or \
   (a == 'ром' and b == 'пират') or (a == 'ром' and b == 'бумага'):
    print('первый')
elif (a == 'камень' and b == 'бумага') or (a == 'камень' and b == 'пират') or \
     (a == 'ножницы' and b == 'камень') or (a == 'ножницы' and b == 'пират') or \
     (a == 'бумага' and b == 'ром') or (a == 'бумага' and b == 'ножницы') or \
     (a == 'пират' and b == 'ром') or (a == 'пират' and b == 'бумага') or \
     (a == 'ром' and b == 'ножницы') or (a == 'ром' and b == 'камень'):
    print('второй')
else:
    print('ничья')